app/views/equipes/_equipes.html.erb

<% @equipes = Equipe.all %>
---
SELECT "equipes".* FROM "equipes"