app/controllers/avaliacos_controller.rb

  def index
    @avaliacos = Avaliaco.all
---
SELECT "avaliacos".* FROM "avaliacos"

  def new
    @pessoa = Pessoa.find(params[:pessoa_id])
---
SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? ORDER BY "pessoas"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @pessoa = Pessoa.find(params[:pessoa_id])
    @avaliaco = @pessoa.avaliacos.build(avaliaco_params)

    respond_to do |format|
      if @avaliaco.save
        Equipe.new.update_media_equipe(@pessoa)
---
SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? ORDER BY "pessoas"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "avaliacos" ("avaliacao", "avaliado_id", "avaliador_id") VALUES (?, ?, ?)  [["avaliacao", 10.0], ["avaliado_id", 1], ["avaliador_id", 2]]
UPDATE "equipes" SET "mediaEq" = ? WHERE "equipes"."id" = ?  [["mediaEq", 10.0], ["id", 19]]

    def set_avaliaco
      @pessoa = Pessoa.find(params[:pessoa_id])
      @avaliaco = Avaliaco.find(params[:id])
---
SELECT  "avaliacos".* FROM "avaliacos" WHERE "avaliacos"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]