app/controllers/comentarios_controller.rb

  def new
    @misso = Misso.find(params[:misso_id])
---
SELECT  "missos".* FROM "missos" WHERE "missos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @misso = Misso.find(params[:misso_id])
    @comentario = @misso.comentarios.build(comentario_params)

    respond_to do |format|
      if @comentario.save
---
SELECT  "missos".* FROM "missos" WHERE "missos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comentarios" ("cometario", "misso_id", "pessoa_id") VALUES (?, ?, ?)  [["cometario", "çlasdfkj"], ["misso_id", 1], ["pessoa_id", 1]]

    def set_comentario
      @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]