app/controllers/equipes_controller.rb

SELECT "equipes".* FROM "equipes"
---
  def index
    @equipes = Equipe.all

INSERT INTO "equipes" ("nomeEq", "mb_1_id", "mb_2_id", "mb_3_id", "mb_S_id") VALUES (?, ?, ?, ?, ?)  [["nomeEq", "ter'"], ["mb_1_id", 1], ["mb_2_id", 2], ["mb_3_id", 3], ["mb_S_id", 4]]
---
  def create
    @equipe = Equipe.new(equipe_params)

    unless validar_equipe(@equipe)
      return
    end

    respond_to do |format|
      if @equipe.save

UPDATE "equipes" SET "mb_S" = ? WHERE "equipes"."ID_equipe" = ?  [["mb_S", 5], ["ID_equipe", 15]]
---
  def update

    unless validar_equipe(Equipe.new(equipe_params))
      return
    end

    respond_to do |format|
      if @equipe.update(equipe_params)

SELECT  "equipes".* FROM "equipes" WHERE "equipes"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def set_equipe
    @equipe = Equipe.find(params[:id])