app/controllers/main_page_controller.rb

SELECT  "pessoas".* FROM "pessoas" ORDER BY "pessoas"."mediaAv" DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @ninjas = Pessoa.all.order(mediaAv: :desc).limit(10)