app/controllers/missos_controller.rb

SELECT "missos".* FROM "missos"
---
  def index
    @missos = Misso.all

INSERT INTO "missos" ("nome", "local", "nv_dific_id", "equipe_id", "pessoa_id") VALUES (?, ?, ?, ?, ?)  [["nome", "laksdjf"], ["local", "kalsdfj"], ["nv_dific_id", 3], ["equipe_id", 1], ["pessoa_id", 1]]
---
  def create
    @misso = Misso.new(misso_params)

    respond_to do |format|
      if @misso.save

DELETE FROM "missos" WHERE "missos"."id" = ?  [["id", 4]]
---
  def destroy
    @misso.destroy

SELECT  "missos".* FROM "missos" WHERE "missos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_misso
      @misso = Misso.find(params[:id])