app/controllers/nv_difics_controller.rb

  def index
    @nv_difics = NvDific.all
---
SELECT "nv_difics".* FROM "nv_difics"

  def create
    @nv_dific = NvDific.new(nv_dific_params)

    respond_to do |format|
      if @nv_dific.save
---
INSERT INTO "nv_difics" ("nivel", "preco") VALUES (?, ?)  [["nivel", "bla"], ["preco", 40.0]]

    def set_nv_dific
      @nv_dific = NvDific.find(params[:id])
---
SELECT  "nv_difics".* FROM "nv_difics" WHERE "nv_difics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]