app/controllers/pessoas_controller.rb

  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "telefone", "dataNasc", "endereco", "user_name", "email", "senha", "ID_Rk", "ID_tp") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["nome", "asdf"], ["telefone", 1234], ["dataNasc", "1234"], ["endereco", "qwer"], ["user_name", "qwer"], ["email", "qwre"], ["senha", "qwer"], ["ID_Rk", 1], ["ID_tp", 2]]

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE "pessoas" SET "rk_ninja_id" = ?, "tp_user_id" = ? WHERE "pessoas"."id" = ?  [["rk_ninja_id", 3], ["tp_user_id", 3], ["id", 1]]

  def set_pessoa
    @pessoa = Pessoa.find(params[:id])
---
SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? ORDER BY "pessoas"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]