app/controllers/rk_ninjas_controller.rb

  def index
    @rk_ninjas = RkNinja.all
---
SELECT "rk_ninjas".* FROM "rk_ninjas"

  def create
    @rk_ninja = RkNinja.new(rk_ninja_params)

    respond_to do |format|
      if @rk_ninja.save
---
INSERT INTO "rk_ninjas" ("rank") VALUES (?)  [["rank", "teste"]]

    def set_rk_ninja
      @rk_ninja = RkNinja.find(params[:id])
---
SELECT  "rk_ninjas".* FROM "rk_ninjas" WHERE "rk_ninjas"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]