app/controllers/tp_users_controller.rb

SELECT "tp_users".* FROM "tp_users"
---
  def index
    @tp_users = TpUser.all

INSERT INTO "tp_users" ("tipo") VALUES (?)  [["tipo", "teste"]]
---
  def create
    @tp_user = TpUser.new(tp_user_params)

    respond_to do |format|
      if @tp_user.save

SELECT  "tp_users".* FROM "tp_users" WHERE "tp_users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_tp_user
      @tp_user = TpUser.find(params[:id])