app/views/missos/_missoes.html.erb

<% @missos = Misso.all %>
---
SELECT "missos".* FROM "missos"