app/views/avaliacos/new.html.erb

SELECT  1 AS one FROM "avaliacos" WHERE "avaliacos"."pessoa_id" = ? AND "avaliacos"."avaliador_id" = ? LIMIT ?  [["pessoa_id", 9], ["avaliador_id", 5], ["LIMIT", 1]]
---

<% if Avaliaco.where(pessoa_id: @pessoa.id, avaliador_id: current_pessoa.id).empty? %>